{
  "HomePage": {
    "aboutTitle": "About Me",
    "aboutContent": "I'm passionate about technology and programming, always looking to learn new technologies and turn ideas into reality through code. In my spare time, I like to relax by playing video games.",
    "firstCourse": "Information Systems Technologies and Programming | 2022-2024",
    "secondCourse": "Computer Engineering | 2024-2027",
    "tech": "Technologies"
  },
  "Navbar": {
    "role": "Software Developer",
    "linkAbout": "About",
    "linkProjects": "Projects"
  },
  "Projects": {
    "ghTitle": "GameHub Backlog",
    "ghText": "GameHub Backlog is a game backlog tracker designed to help you keep track of your ever-growing library of video games.",
    "gesTitle": "GESFaturação - Shopify APP",
    "gesText": "This app automates invoicing for Shopify stores, converting orders into invoices and syncing inventory with GESFaturação. It also sends financial documents automatically."
  },
  "GESApp": {
    "title": "GESFaturação - Shopify APP",
    "text": "This internship project consists of developing an application for Shopify, integrated with FTKode's GESFaturação API, which aims to automate and simplify invoicing processes for online stores. The app makes it possible to convert orders into invoices or receipts automatically, synchronize inventories between Shopify and GESFaturação, and send financial documents by email efficiently and automatically.",
    "featuresTitle": "Features:",
    "feature1": "Secure Authentication: Integrated login with GESFaturação account, ensuring secure and personalized access.",
    "feature2": "Automated Order Management: Automatic conversion of Shopify orders into standard invoices or invoice-receipts in GESFaturação.",
    "feature3": "Inventory Synchronization: Direct inventory integration between Shopify and GESFaturação, keeping data always up-to-date.",
    "feature4": "Document Generation and Sending: Automatic creation of invoices and receipts with email sending option.",
    "feature5": "Intuitive User Interface: Developed with Polaris, offering a user experience consistent with the Shopify ecosystem.",
    "feature6": "Product Management: Addition, editing, and removal of products in the GESFaturação inventory directly from the Shopify interface.",
    "feature7": "Advanced Filters and Pagination: Easy navigation and search across all data tables.",
    "feature8": "Customizable Preferences: Configuration of default values to streamline financial document creation.",
    "feature9": "Action Logging: Detailed logging system to track all operations performed in the application.",
    "feature10": "Data Visualization: Intuitive charts for monthly billing analysis.",
    "feature11": "Root Page Integration: Quick action buttons on Shopify's main pages for common tasks.",
    "feature12": "Robust API: Developed in Express.js, managing secure interactions with PostgreSQL database via Prisma.",
    "technologiesTitle": "Technologies:",
    "conclusion": "GESShop significantly simplifies financial and inventory management for Shopify merchants, providing an all-in-one solution that streamlines daily operations and improves business efficiency."
  },
  "GameHub": {
    "title": "GameHub Backlog",
    "text": "GameHub Backlog is a comprehensive game backlog tracker designed to help you efficiently manage your video game collection. As your library of titles grows, keeping track of what to play next can become a daunting task. GameHub simplifies this by providing a centralized platform to organize, prioritize, and manage your games with ease.",
    "live": "Live",
    "sourceCode": "Source Code",
    "featuresTitle": "Features:",
    "feature1": "Google Authentication: Securely sign in using your Google account.",
    "feature2": "Comprehensive Game Database: Browse and view details of games worldwide using the IGDB API.",
    "feature3": "Advanced Search and Filtering: Search for games with various filters including Genres, Themes, Platforms, Perspectives, and Game Modes.",
    "feature4": "Game Backlog Management: Track your game progress by adding games to your backlog with status options ('Played', 'Playing', 'Dropped', 'Plan to Play') and progress indicators ('Unfinished', 'Beaten', 'Completed', 'Continuous').",
    "feature5": "Price Comparison: View and compare the prices of Steam games across several trusted stores to find the best deals.",
    "feature6": "User Profiles: Access and manage your profile to view and organize your tracked games. Search for games by name, filter by status and progress, and sort by rating and name. Share your profile with friends and explore other users' profiles to see their game collections.",
    "feature7": "Light and Dark Modes: Switch between light and dark themes for a customizable viewing experience.",
    "technologiesTitle": "Technologies:"
  }
}